Revit 2027 API
ParameterTypeId.AnalyticalLinkReleaseRotationX Property
 "X Rotation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalLinkReleaseRotationX { get; }
Public Shared ReadOnly Property AnalyticalLinkReleaseRotationX As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalLinkReleaseRotationX {
	ForgeTypeId^ get ();
}
static member AnalyticalLinkReleaseRotationX : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace